In [8]:
import csv
import sqlite3

In [9]:
import pandas as pd

In [10]:
connection = sqlite3.connect('g4g.db')

In [11]:
cursor = connection.cursor()

In [12]:
sales_data = pd.read_csv('C:/Users/Apoorva/Downloads/Python_Evaluation-main/SQL_Evaluation_1/sales_data.csv')

In [13]:
sales_data

           date Sales Rep  Revenue
0    2022-06-01      Mike      119
1    2022-06-01       Ian      248
2    2022-06-01      Fank      356
3    2022-06-01       Sue      300
4    2022-06-01     Sarah      365
..          ...       ...      ...
346  2022-08-09       Ian      148
347  2022-08-09      Fank      356
348  2022-08-09       Sue      269
349  2022-08-09     Sarah      410
350  2022-08-10      Mike       40

[351 rows x 3 columns]

In [14]:
sales_data.to_sql('sales_val',connection,if_exists='append',index=False)

C:\Users\Apoorva\anaconda3\lib\site-packages\pandas\core\generic.py:2872: UserWarning: The spaces in these column names will not be changed. In pandas versions < 0.14, spaces were converted to underscores.
  sql.to_sql(

In [15]:
query= "select *FROM sales_val"

In [16]:
df=pd.read_sql(query,connection)
df

            date Sales Rep  Revenue
0     2022-06-01      Mike      119
1     2022-06-01       Ian      248
2     2022-06-01      Fank      356
3     2022-06-01       Sue      300
4     2022-06-01     Sarah      365
...          ...       ...      ...
4558  2022-08-09       Ian      148
4559  2022-08-09      Fank      356
4560  2022-08-09       Sue      269
4561  2022-08-09     Sarah      410
4562  2022-08-10      Mike       40

[4563 rows x 3 columns]

In [17]:
query="SELECT strftime('%m', Date) as month,sum(Revenue) FROM sales_val group by month order by month"

In [18]:
df=pd.read_sql(query,connection)

In [19]:
df

  month  sum(Revenue)
0    06        487721
1    07        527189
2    08        151801

In [20]:
connection.close()